////////////////////////////////////////////////////////

// 1. Функция принимает массив и выводит его на экран.

// let arr = [37,22,64,17,325,2,7,6,0,81]

// function printArr(arr){
//     for (let i = 0; i < arr.length; i++ ){
//         console.log(arr[i]);
//     }
// }
// printArr(arr)

/////////////////////////////////////////////////////////////

// 2. Функция принимает массив и выводит только четные элементы.

// 3. Функция принимает массив и возвращает сумму всех
// элементов массива.


// let arr = [37,21,64,17,325,2,7,6,0,81]

// function arrSum(arr){
// let sum = 0;

// for(let i = 0; i < arr.length; i++){
//     sum += arr[i];
//     }
// console.log(sum);
// }
// arrSum(arr);

////////////////////////////////////////////////////////

// Функция принимает массив и возвращает его минимальный элемент.


// let arr = [37,21,64,17,325,2,7,6,81]

// function minArr(arr){
//     let min = arr[0];

//     for (let i = 0; i < arr.length; i++) {
        
        
//             if (min > arr[i]) {
//                 min = arr[i]
                
//             }
//     }
//     return min;
// }

// let minimum = minArr(arr);
// console.log(minimum);


// //////////////////////////////////////////////////

// 4. Функция принимает массив и возвращает его максимальный элемент.

// let arr = [37,21,64,17,325,2,7,6,81]

// function maxArr(arr){
//     let max = [0];

//     for (let i = 0; i < arr.length; i++) {
        
//         if (max < arr[i]){
//             max = arr[i];
//         } else {

//         }
//     }
//     return max;
// }

// let maximum = maxArr(arr)
// console.log(maximum);


////////////////////////////////////////////////////////////

// 5. Функция добавления нового элемента в массив по указанному индексу.

// let arr = [37,21,64,17,325,2,7,6,81]

// function addNum (arr) {
//     arr.splice(3, 0, 100, 200, 300)
    
// }
// addNum (arr)
// console.log(arr);


//////////////////////////////////////////////////////////////

// 6. Функция удаления элемента из массива по указанному
// индексу. 

// let arr = [37,21,64,17,325,2,7,6,81]

// function delNum (arr) {
//     arr.splice(1, 2)
    
// }
// delNum (arr)
// console.log(arr);

//////////////////////////////////////////////////////

// 7. Функция принимает 2 массива и возвращает новый массив, в котором собраны все элементы из двух массивов
// без повторений.

// let arr = [37,21,64,17,325,2,7,6,81]
// let arrTwo = [16, 31, 99, 20]

// function concatArr(arr, arrTwo){
//     let result = arr.concat(arrTwo)
//     console.log(result);
// }

// concatArr(arr, arrTwo)